app/controllers/api/personal_records_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def index
        currentUser = User.where(id: params[:user_id].to_i).first

INSERT INTO "personal_records" ("date", "weight", "reps", "exercise", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["date", "2020-03-28"], ["weight", 225], ["reps", 1], ["exercise", "squat"], ["created_at", "2020-03-28 21:47:14.178008"], ["updated_at", "2020-03-28 21:47:14.178008"], ["user_id", 4]]
---
    def create
        @personal_record = PersonalRecord.new(personal_record_params)
        if @personal_record.save