app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)
        weight = params[:user][:weight].to_f
        bf = params[:user][:body_fat_percentage].to_f
        fm = ((bf/100) * weight).round(1)
        lm = (weight - fm).round(1)
        debugger
        if @user.save
            login(@user)
            debugger
            WeightLog.create(user_id: @user.id, date: Date.today(), body_fat_percentage: params[:user][:body_fat_percentage], weight: params[:user][:weight], lean_mass: lm, fat_mass: fm)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at", "session_token", "name", "dob", "height") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at", "session_token", "name", "dob", "height", "age", "converted_height") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "weight_logs" ("user_id", "date", "body_fat_percentage", "weight", "lean_mass", "fat_mass", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"