app/controllers/api/weight_logs_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "weight_logs".* FROM "weight_logs" WHERE "weight_logs"."user_id" = $1 ORDER BY date  [["user_id", 1]]
---
    def index
        currentUser = User.where(id: params[:user_id].to_i).first
        @weight_logs = currentUser.weight_logs.order('date')

INSERT INTO "weight_logs" ("user_id", "date", "body_fat_percentage", "weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 4], ["date", "2020-03-27"], ["body_fat_percentage", "10.0"], ["weight", "200.0"], ["created_at", "2020-03-28 03:13:51.547516"], ["updated_at", "2020-03-28 03:13:51.547516"]]
---
    def create
        @weight_log = WeightLog.new(weight_log_params)
        if @weight_log.save