app/models/user.rb

    def reset_session_token
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-04-01 22:21:45.968565"], ["session_token", "nz6oi2OLBe1QwtXdG_e8lA"], ["id", 29]]